{
    "colors": {
        "simple": {
            "background": "#003917",
            "line": "#aaffcc",
            "title": "#ffffff",
            "qr": "#ffffff"
        },
        "powerful": {
            "background": "#003917",
            "line": "#aaffcc",
            "title": "#ffffff",
            "qr": "#ffffff"
        },
        "abstract": {
            "background": "#162d50",
            "line": "#8ba7d9",
            "title": "#ffffff",
            "qr": "#ffffff"
        },
        "concrete": {
            "background": "#162d50",
            "line": "#8ba7d9",
            "title": "#ffffff",
            "qr": "#ffffff"
        },
        "pragmatic": {
            "background": "#900000",
            "line": "#f4d7d7",
            "title": "#ffffff",
            "qr": "#ffffff"
        },
        "idealistic": {
            "background": "#900000",
            "line": "#f4d7d7",
            "title": "#ffffff",
            "qr": "#ffffff"
        },
        "robust": {
            "background": "#f0c873",
            "line": "#784421",
            "title": "#000000",
            "qr": "#784421"
        },
        "technologic": {
            "background": "#f0c873",
            "line": "#784421",
            "title": "#000000",
            "qr": "#784421"
        },
        "question": {
            "background": "#ff9955",
            "line": "#784421",
            "title": "#000000",
            "qr": "#784421",
            "symbol": "?"
        },
        "action": {
            "background": "#ff9955",
            "line": "#784421",
            "title": "#000000",
            "qr": "#784421",
            "symbol": "!"
        },
        "joker": {
            "background": "#4d4d4d",
            "line": "#e6e6e6",
            "title": "#e6e6e6",
            "qr": "#e6e6e6",
            "symbol": "todo"
        }
    },
    "cards": [
        {
            "abbreviation": "KISS",
            "name": "Keep It Simple Stupid",
            "short": "Simple means readable, maintainable, and less error-prone. Overengineering is harmful.",
            "long": "Complex code contains more bugs and it has to be maintained (maybe even by other people). To others, it may seem obscure which can lead to frustration and bad code quality. Striving for simplicity means to avoid having large modules (methods/classes/...), many modules (methods/classes/...), as well as inheritance, low-level optimization, complex algorithms, fancy (lan-guage) features, configurability, etc.",
            "links": "↑CF, ↓RoP, ↓NFR, ↓LC",
            "set": "basic",
            "shield": "simple"
        },
        {
            "abbreviation": "YAGNI",
            "name": "You Ain’t Gonna Need It",
            "short": "It’s currently not necessary, and we even have to maintain it!",
            "long": "Code needs to be maintained. The more you have, the more complexity there will be. Adding features and capabilities that are not used (yet), wastes time twice: When you write the code and when you change or just read it. This becomes even more painful when you finally try to re-move this dead code. So avoid runtime-configu-ration, premature optimization, and features that are only there “for the sake of complete-ness”. If they are needed, add them later.",
            "links": "↑CF, ↓PSPG, ↓TP, ⇅FP",
            "set": "advanced",
            "shield": "simple"
        },
        {
            "abbreviation": "EUHM",
            "name": "Easy to Use and Hard to Misuse",
            "short": "It shouldn’t require much discipline or special knowledge to use or extend that module.",
            "long": "Some day there will be a new colleague who hasn’t read the docs. Some day it will be Friday evening right before the deadline. No matter how disciplined or smart you are, some day somebody will cut corners. So better have the obvious way of usage be the correct one. Have the compiler or the unit tests fail in case of errors and keep sure that changing a module does not require much understanding.",
            "links": "↑ML, ↑PSU, ↑UP, ⇅KISS",
            "set": "advanced",
            "shield": "simple"
        },
        {
            "abbreviation": "RoE",
            "name": "Rule of Explicitness",
            "short": "Explicit solutions are less error-prone and easier to understand and debug.",
            "long": "Implicit solutions require the developer to have a deeper understanding of the module, as it is necessary to “read between the lines”. Explicit solutions are less error-prone and easier to maintain. So better avoid configurability, unnecessary abstractions and indirection (events, listeners, observers, etc.).",
            "links": "↑KISS, ↓RoP, ↓LC, ⇅FP",
            "set": "advanced",
            "shield": "simple"
        },
        {
            "abbreviation": "RoP",
            "name": "Rule of Power",
            "short": "Foresighted, generic solutions are reusable and future requirements will be addressed, too.",
            "long": "A powerful solution is better than a less potent one. Foresighted solutions reduce the necessity of refactoring and are more stable over time. Generic solutions often need less code and additionally offer extensibility by design. So better use abstractions, indirection, GoF patterns, polymorphism, etc.",
            "links": "↑FP, ↑DRY, ↓YAGNI, ↓CF",
            "set": "basic",
            "shield": "powerful"
        },
        {
            "abbreviation": "FP",
            "name": "Flexibility Principle",
            "short": "We have to make sure that we can change that later on.",
            "long": "While it is often not necessary to implement a fully generic solution, in many cases it is important to be flexible. Even if a generic solution isn’t implemented right away, it must still be possible to do so. E.g. if you don’t want to implement runtime-configurability, at least have a constant ready to be made configurable. Make sure that the solution does not spoil or hinder future changes or enhancements.",
            "links": "↑RoP, ↑LC, ↑ML, ↓ICC",
            "set": "advanced",
            "shield": "powerful"
        },
        {
            "abbreviation": "NFR",
            "name": "Non-Functional Requirements",
            "short": "We have to think about NFRs now. Adding these qualities later will be very hard.",
            "long": "Software needs to be efficient, scalable, secure, usable, maintainable, testable, resilient, reli-able, compliant with (data privacy) regulations, etc. These qualities have a huge impact on the architecture. You might need to choose certain technologies for performance, use microser-vices for scalability, or provide redundant sub-systems for reliability. Thinking about this later results in waste and additional cost/effort.",
            "links": "↑ML, ↓YAGNI, ↓KISS, ⇅FP",
            "set": "advanced",
            "shield": "powerful"
        },
        {
            "abbreviation": "ECV",
            "name": "Encapsulate the Concept that Varies",
            "short": "Changing parts of the software should get their own module or abstraction.",
            "long": "If you have to change your software, you’d like those changes to be isolated, so you don’t have to change half your system. So put the chang-ing parts into separate modules. Isolate chang-ing APIs via gateway classes, data access tech-nology using DAOs, encapsulate algorithms using the strategy pattern, etc. Conversely, don’t use abstractions for those parts that won’t change.",
            "links": "↑RoP, ↑IH/E, ↓YAGNI, ↓RoE",
            "set": "advanced",
            "shield": "powerful"
        },
        {
            "abbreviation": "LC",
            "name": "Low Coupling",
            "short": "Tight coupling creates ripple-effects and makes the code less maintainable.",
            "long": "If you decouple, you don’t need to know internal details about other parts of the system. Furthermore, it makes you independent of changes in those other parts and it even enables reuse. So better reduce the number of dependencies and assumptions about other modules, use narrow interfaces, additional layers, indirection, dependency injection, observers, messaging, etc.",
            "links": "↑FP, ↑ML, ↓KISS, ⇅SRP",
            "set": "basic",
            "shield": "abstract"
        },
        {
            "abbreviation": "SRP",
            "name": "Single Responsibility Principle",
            "short": "One module should do one thing only.",
            "long": "If there is more than one reason to change a certain module (method/class/artifact/...), i.e. the module has more than one responsibility, then code becomes fragile. Changing one responsibility may result in involuntary changes to the other. Furthermore, changing the module is more difficult and takes more time. And even when you don’t change the module at all, understanding it is more complex. So better separate concerns into separate modules.",
            "links": "↑PSU, ↑IOSP, ⇅LC, ⇅KISS",
            "set": "advanced",
            "shield": "abstract"
        },
        {
            "abbreviation": "ADP",
            "name": "Acyclic Dependencies Principle",
            "short": "Cyclic dependencies create rigid structures.",
            "long": "Cyclic dependencies result in all sorts of nasty consequences: tight couplings, deadlocks, infinite recursions, ripple effects, bad maintainability, etc. The larger the cycle, the worse the consequences will get and the harder they are to understand and to break apart. So avoid them by using dependency inversion, publish-subscribe mechanisms or just by assigning responsibilities to modules hierarchically.",
            "links": "↑LC, ↑ML, ↓RoE, ↓ICC",
            "set": "advanced",
            "shield": "abstract"
        },
        {
            "abbreviation": "IOSP",
            "name": "Integration Operation Segregation Principle",
            "short": "A module should either contain business logic or integrate other modules but not both.",
            "long": "Either a module (method/class/...) is an opera-tion, i.e. it contains business logic and/or API calls or it is an integration, i.e. it calls other modules. That means operations should never call other modules and integrations should have no business logic and no API calls. Operations are easy to read, test, and reuse. And integra-tions are very simple, too. This ensures that modules are small and systems well-structured.",
            "links": "↑LC, ↑SRP, ⇅KISS, ⇅PSU",
            "set": "advanced",
            "shield": "abstract"
        },
        {
            "abbreviation": "DRY",
            "name": "Don’t Repeat Yourself",
            "short": "Duplication makes changing the code cumbersome and leads to bugs.",
            "long": "Having a functionality more than once means to update or bug-fix it at every occurrence which is more error-prone and more effort. Refactor-ings like method or class extraction may help as well as inheritance, higher-order functions, polymorphism, and some design patterns.",
            "links": "↑RoP, ↑PoQ, ↓KISS, ↓PSU",
            "set": "basic",
            "shield": "concrete"
        },
        {
            "abbreviation": "IH/E",
            "name": "Information Hiding/Encapsulation",
            "short": "Only what is hidden, can be changed without risk.",
            "long": "There are 3 levels of IH/E: 1) Having a capsule means, that you have methods for accessing the data of the module. 2) Making the capsule opaque means that you can only access the data through the methods (i.e. all fields are private). 3) Making the capsule impenetrable means that you avoid returning references to mutable internal data structures. Either you make them immutable or you create copies in getter/setter methods.",
            "links": "↑MP, ↑LC, ↑FP, ⇅ KISS",
            "set": "advanced",
            "shield": "concrete"
        },
        {
            "abbreviation": "PSU",
            "name": "Principle of Separate Understandability",
            "short": "You shouldn’t need to know other parts for understanding this one.",
            "long": "Each module (method/class/artifact/service/...) should be understandable on its own. Understanding becomes a lot more difficult if you cannot apply divide and conquer. Furthermore, if something is not separately understandable, this typically means either that a part of the functionality does not belong here or the module has the wrong abstraction.",
            "links": "↑LC, ↑MP, ↑ML, ⇅TdA/IE",
            "set": "advanced",
            "shield": "concrete"
        },
        {
            "abbreviation": "TdA/IE",
            "name": "Tell don’t Ask/Information Expert",
            "short": "Functionality should be where the data is.",
            "long": "Instead of asking a module for data, processing it, and putting it back afterwards, better just delegate. This reduces complexity in those modules which are already large (and may even be-come god classes). So avoid getters and setters in favor of methods containing domain logic. In other words: Logic should be implemented in that module that already has the necessary data, that is the information expert.",
            "links": "↑IH/E, ↓PSU, ⇅SRP, ⇅LC",
            "set": "advanced",
            "shield": "concrete"
        },
        {
            "abbreviation": "CF",
            "name": "Customer Focus",
            "short": "This is not what the customer pays us for!",
            "long": "If something is not requested, there has to be a very good reason to do it. Anything in addition costs additional time (also for removing or maintaining it). It creates the additional risk of more bugs and makes you responsible for it. Continuously remember what was requested e.g. by looking into the requirements or asking the customer.",
            "links": "↑EaO, ↑YAGNI, ↓PoQ, ⇅FP",
            "set": "basic",
            "shield": "pragmatic"
        },
        {
            "abbreviation": "ICC",
            "name": "In the Concrete Case",
            "short": "Your arguments are valid but in the concrete case the advantages won’t be important.",
            "long": "Many arguments hold true in general but when we look at the decision to be made, the effects they describe are sometimes negligible. Yes, low coupling is important, uniformity is helpful, and flexibility is desirable. But these aspects are sometimes crucial and sometimes irrele-vant. So better focus on arguments that are rel-evant in the concrete case instead of insisting on aspects just to satisfy idealistic pettiness.",
            "links": "↑CF, ↑YAGNI, ↓PoQ, ↓PSPG",
            "set": "advanced",
            "shield": "pragmatic"
        },
        {
            "abbreviation": "EaO",
            "name": "Early and Often",
            "short": "Going online soon means to get value and feedback soon.",
            "long": "Business success is often built on being faster than competitors. Building mini- mum viable products and 80%-solutions facilitate a faster time to market. More- over the best feedback for improvement comes after a release and is rarely design- ed up front. So avoid perfectionism, re- lease early and often, and accept a certain amount of technical debt.",
            "links": "↑FRD, ↑TP, ⇅PoQ, ⇅IR",
            "set": "advanced",
            "shield": "pragmatic"
        },
        {
            "abbreviation": "UFT",
            "name": "Use Familiar Technology",
            "short": "Using well-known technology results in faster outcome and fewer time-consuming bugs.",
            "long": "Well known technologies are easier to handle because you can focus on the job and you know all the pitfalls. If you use unfamiliar technology, you most likely won’t do that well at first. This results in even more bugs and worse design. So better use those technologies that all (current and future) developers are most familiar with.",
            "links": "↑UP, ↑IR, ↓TP, ⇅ML",
            "set": "advanced",
            "shield": "pragmatic"
        },
        {
            "abbreviation": "PoQ",
            "name": "Principle of Quality",
            "short": "Bad quality kills us in the long run!",
            "long": "It may be faster now, but we need to be fast tomorrow, too. Bad quality frustrates maintain-ers, makes fixing bugs harder and leads to huge efforts for changes. This often starts by being careless once. Don’t let a vicious circle begin. Use metrics, adhere to the architecture, have a high test coverage, apply code reviews and re-factor continuously. Don’t be lazy.",
            "links": "↑LC, ↑ML, ↓CF, ⇅EaO",
            "set": "basic",
            "shield": "idealistic"
        },
        {
            "abbreviation": "UP",
            "name": "Uniformity Principle",
            "short": "Solve similar problems in the same way.",
            "long": "Following UP reduces the number of different solutions. There are fewer concepts to learn, fewer problems to solve and fewer kinds of defects that can occur. So have a consistent structure, a consistent naming scheme and use the same mechanisms and libraries everywhere. Prefer using the same approaches and not just similar ones as subtle differences lead to bugs.",
            "links": "↑ML, ↑RoS, ↓ICC, ⇅KISS",
            "set": "advanced",
            "shield": "idealistic"
        },
        {
            "abbreviation": "MP",
            "name": "Model Principle",
            "short": "Program close to the problem domain.",
            "long": "Software should model and mirror the concepts and actions of the real world. So avoid every-thing that works “accidentally”. If it works acci-dentally, it breaks accidentally. So be precise with semantics. If you need to delete an order in a data migration routine, call deleteOrder and not cancelOrder—even if that currently does the same. cancelOrder might get enhanced such that it creates a reverse order which wouldn’t be correct for data migration anymore.",
            "links": "↑ML, ↑TdA/IE, ⇅KISS, ⇅ADP",
            "set": "advanced",
            "shield": "idealistic"
        },
        {
            "abbreviation": "PSPG",
            "name": "A Penny Saved Is a Penny Got",
            "short": "It might not be a big advantage, but it’s not a big cost either.",
            "long": "Making little improvements a habit sums up to a big advantage. This is the reason behind the boy scout rule (“Leave the campground cleaner than you’ve found it”). You don’t have to clean the whole forest but if everyone leaves the campground just a little cleaner, we will have a clean forest in the end. So if it’s not a big deal, update libraries, improve documenta-tion, and refactor the modules you are currently touching anyway.",
            "links": "↑PoQ, ↑EaO, ↑FRD, ↓CF",
            "set": "advanced",
            "shield": "idealistic"
        },
        {
            "abbreviation": "ML",
            "name": "Murphy’s Law",
            "short": "Avoid possibilities for something to go wrong or to get misused.",
            "long": "If there is a possibility for something to be used in the wrong way (like supplying parameters in the wrong order), it will eventually happen. So better avoid possible future bugs by using defensive programming, immutability, a common naming scheme, avoiding duplication and complexity.",
            "links": "↑FF, ↑EUHM, ↓ICC, ⇅KISS",
            "set": "basic",
            "shield": "robust"
        },
        {
            "abbreviation": "IR",
            "name": "Instability Risk",
            "short": "Bleeding edge often leads to blood and pain.",
            "long": "New technology often comes with teething problems. Using too unstable software, beta versions of libraries, or anything that hasn’t stood the test of time is risky. There may be unknown bugs, nasty little quirks and compati-bility issues no one has heard of, yet. This also means that if you encounter these problems, you will be one of the first to face them.",
            "links": "↑RoS, ↑UFT, ↓TP, ↓FRD",
            "set": "advanced",
            "shield": "robust"
        },
        {
            "abbreviation": "FF",
            "name": "Fail fast",
            "short": "Program defensively or you’ll have a hard time debugging.",
            "long": "If you don’t check your inputs, cascading fail-ures can occur. This results in security prob-lems and error messages which are hard to de-cipher because they are not thrown at the posi-tion of the actual fault. This may even lead to situations where teams have to investigate fail-ures which are not theirs. So log and throw an error as soon as you realize a problem. The earlier the better, so throwing a compile-time error is preferable to run-time checks.",
            "links": "↑ML, ↑EUHM, ↓KISS, ⇅NFR",
            "set": "advanced",
            "shield": "robust"
        },
        {
            "abbreviation": "RoS",
            "name": "Rule of Standardization",
            "short": "Adhering to standards makes systems easier to understand and reduces bugs.",
            "long": "Sticking to standards reduces complexity. If you are familiar with the standard, understanding systems that adhere to it will be much easier. Also, standards ensure a certain degree of inter-operability and maturity. So use standard tech-nologies, standard architectures, standard cod-ing styles, standard formatting, standardized checklists, etc. If there are no formal standards, create your own in-house standard.",
            "links": "↑DRW, ↑NFR, ⇅KISS, ⇅TP",
            "set": "advanced",
            "shield": "robust"
        },
        {
            "abbreviation": "TP",
            "name": "Technological Progress",
            "short": "Progress must not be ignored in a competitive environment.",
            "long": "New technology is not only motivating but also comes with benefits like more features, more performance, better maintainability, and fixed bugs. Furthermore, old technology won’t be supported for much longer and new people don’t know the old stuff anymore. Continuously challenge existing solutions by evaluating alternatives.",
            "links": "↑FRD, ↓IR, ↓UFT, ⇅RoS",
            "set": "basic",
            "shield": "technologic"
        },
        {
            "abbreviation": "FRD",
            "name": "Frequency Reduces Difficulty",
            "short": "If it hurts, do it more often!",
            "long": "Typically, it’s easier and less effort to go small steps continuously than to wait until there is a huge gap to bridge. The pain will be bigger the more you post- pone it—break the cycle and update to new versions, refactor regularly, merge and release early and often. Doing some- thing more often, leads to more practice and fewer mistakes.",
            "links": "↑ML, ↑EaO, ↓IR, ↓ICC",
            "set": "advanced",
            "shield": "technologic"
        },
        {
            "abbreviation": "DRW",
            "name": "Don’t Reinvent the Wheel",
            "short": "Focus on real challenges instead of old ones.",
            "long": "If something has already been solved, it’s prob-ably solved in a better way than we will manage to do in the time we have. No one would ever reimplement a cache or a search algorithm ex-cept it is one’s core competency. So focus on the challenges of your core business and use standards, libraries, and frameworks. They are the core business of those people who create and maintain them. They’ve solved many prob-lems that we haven’t even thought of, yet.",
            "links": "↑EbE, ↓LC, ↓ICC, ⇅RoS",
            "set": "advanced",
            "shield": "technologic"
        },
        {
            "abbreviation": "EbE",
            "name": "Experience by Experiments",
            "short": "We’ll never know if we don’t try!",
            "long": "Discussing advantages and disadvantages theo-retically can be helpful but at a certain point you will never know which variant is better if you don’t try. So if you have a standard solution to a problem, try the other one. Carefully but regularly try out new frameworks and libraries, new coding guidelines, architectural/design patterns etc. in real-world projects. Failed experiments will be refactored and successful experiments will stay and become the new standard.",
            "links": "↑TP, ↓IR, ↓CF, ⇅FP",
            "set": "advanced",
            "shield": "technologic"
        },
        {
            "abbreviation": "qFoc",
            "name": "Focus",
            "short": "Are we still on the right track or have we lost focus?",
            "long": "Discussions are weird sometimes. You start with the clear aim to decide whether solution A or B is better and end up with a discussion on something completely different. You easily get lost in side issues or you heavily argue on something unimportant (“bike-shedding”). So clarify the main topic of your discussion and keep the focus on it.",
            "links": "",
            "set": "basic",
            "shield": "question"
        },
        {
            "abbreviation": "qTS",
            "name": "Third Solution",
            "short": "Are we discussing all relevant possibilities?",
            "long": "Sometimes we argue heavily if solution A or B is better when in fact there is a third solution C that may be preferable. So regularly ask yourself (and your colleagues) whether there is a solution that needs to be discussed, too.",
            "links": "",
            "set": "basic",
            "shield": "question"
        },
        {
            "abbreviation": "qTRT",
            "name": "The Right Time",
            "short": "What will happen if we don’t decide right now?",
            "long": "A design decision should be taken as late in the project as possible. But it’s likewise harmful to take it too late. In order to find out if a decision really needs to be made now, think about what will happen, if the decision is deferred.",
            "links": "",
            "set": "advanced",
            "shield": "question"
        },
        {
            "abbreviation": "qSta",
            "name": "Stakeholders",
            "short": "Do we have the needs of all stakeholders in mind?",
            "long": "Some decisions have influence on many stakeholders—some of which are often forgotten. Also, think about QA, Ops, etc.",
            "links": "",
            "set": "advanced",
            "shield": "question"
        },
        {
            "abbreviation": "qCon",
            "name": "Consequences",
            "short": "What will happen if we make the wrong decision?",
            "long": "Think about possible impacts, chances of occurrence, and possibilities to revert. If the consequences are not bad at all, then it might be better to shorten the discussion. If the consequences are severe, there should be some means of mitigation in place. In any case think about the consequences of a decision.",
            "links": "",
            "set": "advanced",
            "shield": "question"
        },
        {
            "abbreviation": "qMU",
            "name": "Mutual Understanding",
            "short": "Do we really understand each other’s points of view?",
            "long": "Sometimes a discussion gets stuck because of misunderstandings or misinterpretations. Commonly that’s because everyone is busy explaining their own point of view without trying to understand the other. If that’s the case, it is necessary to realize that. Otherwise, there will be no progress in the discussion.",
            "links": "",
            "set": "advanced",
            "shield": "question"
        },
        {
            "abbreviation": "qFS",
            "name": "From Scratch",
            "short": "What would be the “real solution” if we’d start from scratch?",
            "long": "Often the solutions we come up with are tied to the current state of the software. Our thinking is restricted such that we do not consider certain possibilities. In such cases it is helpful to neglect the circumstances of the current system for a moment—think outside the box. Even if the greenfield solution you then come up with is not directly applicable, it’s often a starting point for an alternative.",
            "links": "",
            "set": "advanced",
            "shield": "question"
        },
        {
            "abbreviation": "qBSU",
            "name": "Best Solution for the User",
            "short": "Do we really address the real user’s needs?",
            "long": "Not in every case the person who specifies what to do is identical to the user of the system. Wrong interpretations or misunderstandings may lead to unsuitable solutions that do not satisfy the real user’s needs. Every now and then, you should ask yourself if you are still designing a system that really helps those who will eventually use it.",
            "links": "",
            "set": "advanced",
            "shield": "question"
        },
        {
            "abbreviation": "aMed",
            "name": "Mediator",
            "short": "We cannot agree. Let’s get some help!",
            "long": "Sometimes a discussion gets stuck. In these cases it is often advisable to ask another colleague for an opinion or mediation. Usually a colleague who hasn’t already participated in the discussion, adds a new, unbiased perspective.",
            "links": "",
            "set": "basic",
            "shield": "action"
        },
        {
            "abbreviation": "aTD",
            "name": "Team Decision",
            "short": "The decision is too important to take alone. Let’s have the whole team decide!",
            "long": "Important decisions which affect many people like architectural decisions, big refactorings, and external APIs should be taken by the whole team. First, this typically results in better decisions. Second, the team will be much more committed to the decision. And third this fosters knowledge transfer.",
            "links": "",
            "set": "basic",
            "shield": "action"
        },
        {
            "abbreviation": "aDaC",
            "name": "Divide and Conquer",
            "short": "Actually we are mixing up two aspects or two decisions. Let’s discuss them separately.",
            "long": "Design decisions get complicated or stuck if there is actually more than one decision to make. The discussion shifts from one topic to the other and back again. This gets even worse if nobody realizes that there is actually more than one problem.  Step back, find out which decisions or problems there are and discuss them separately.",
            "links": "",
            "set": "advanced",
            "shield": "action"
        },
        {
            "abbreviation": "aRes",
            "name": "Research",
            "short": "Let’s have a look if there is already a suitable solution.",
            "long": "When making a decision, make sure that you know all relevant solutions. Many problems have already been solved. So before inventing an own algorithm, have a look at libraries and scientific papers. For certain design decisions have a look at standards and patterns. Also, con-sider researching code snippets for common programming issues. Maybe there is even commercial-off-the-shelf (COTS) or open-source software you can leverage.",
            "links": "",
            "set": "advanced",
            "shield": "action"
        },
        {
            "abbreviation": "aFC",
            "name": "Flip a Coin",
            "short": "That’s not worth the discussion!",
            "long": "In some cases the difference between several solutions is negligible. Or both the solutions have their pros and cons without one being superior to the other. It is then better to just take the decision by flipping a coin than to waste time in a lengthy and pointless discussion.",
            "links": "",
            "set": "advanced",
            "shield": "action"
        },
        {
            "abbreviation": "aDA",
            "name": "Devil’s Advocate",
            "short": "There is no real discussion, and we risk missing a point. Let’s appoint a devil’s advocate.",
            "long": "Sometimes you agree too fast on a solution—probably because you all have a similar way of thinking. In such a case you can appoint some-one who has to argue against that solution. A similar problem occurs when none of you has a strong tendency towards any of the solutions. In such a case, for each solution appoint a rep-resentative who tries to argument for this and against the other solutions.",
            "links": "",
            "set": "advanced",
            "shield": "action"
        },
        {
            "abbreviation": "aPO",
            "name": "Product Owner Decides",
            "short": "This has a significant impact on the business, so we have to talk with the product owner.",
            "long": "Some technical decisions influence the product itself. Often there is an impact on cost and time and sometimes there are even legal issues. Trade-offs include hosting an application in the cloud (flexibility and time vs. privacy and cost), adding a caching layer (performance vs. com-plexity and cost), make-or-buy (time vs. flexibi-lity and cost), etc. In those cases the decision is not merely a technical one. Involve the PO.",
            "links": "",
            "set": "advanced",
            "shield": "action"
        },
        {
            "abbreviation": "aCD",
            "name": "Client Decides",
            "short": "The client who calls the API knows best how the ideal API should look like.",
            "long": "APIs need to be intuitive to those who use it and sometimes it’s hard to predict if that’s the case. Some decisions have an impact on how a module can be used. Some use cases may get simpler and others may get harder and less intuitive. Better stop assuming you know what’s best for the clients. Just ask and involve them in your decision.",
            "links": "",
            "set": "advanced",
            "shield": "action"
        },
        {
            "abbreviation": "J",
            "name": "Joker",
            "short": "I don't have a card for this but let me explain.",
            "long": "That's OK. Don't feel restricted in the arguments you use as long it's a valid one. Maybe you don't find the corresponding card fast enough, maybe the card is not in your deck or maybe there is no card for your argument. Never mind: If it's convincing, use it. Nevertheless, limit yourself to a single and graspable argument.",
            "links": "",
            "set": "basic",
            "shield": "joker"
        }
    ]
}

